cask_args appdir: '/Applications'

tap 'caskroom/cask'

# System
brew 'nodenv'
brew 'pyenv'
brew 'rbenv'

cask 'java' unless system '/usr/libexec/java_home --failfast'
brew 'maven'
brew 'gradle'
cask 'caffeine'
cask 'docker'

# Shells
brew 'bash-completion'
brew 'zsh'
brew 'zsh-completions'

# Terminal & CLI
brew 'htop'
brew 'jq'
brew 'mtr'
brew 'nmap'
brew 'pwgen'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'wget'

cask 'iterm2'

# Cloud Services
cask '1password'
cask 'dropbox'
cask 'evernote'
cask 'google-drive-file-stream'

# Communication
cask 'slack'
cask 'skype'

# Editors & IDEs & Tools
cask 'intellij-idea'
cask 'pycharm'
cask 'visual-studio-code'
brew 'vim'

# Web
cask 'google-chrome'
cask 'kindle'
