cask_args appdir: '/Applications'

# System
brew 'nodenv'
brew 'pyenv'
brew 'rbenv'
brew 'jenv'

cask 'caffeine'

# Shells
brew 'bash-completion'
brew 'zsh'
brew 'zsh-completions'

# Terminal & CLI
brew 'htop'
brew 'tree'
brew 'watch'
brew 'wget'

cask 'iterm2'

# Communication
cask 'slack'
cask 'whatsapp'
cask 'telegram'

# Editors & IDEs & Tools
cask 'intellij-idea'
cask 'pycharm'
cask 'rubymine'
cask 'visual-studio-code'
brew 'vim'
cask 'rancher'

# Utils
cask 'scroll-reverser'

# Streaming
cask 'spotify'
